{"config": [{"config": {"trainable": true, "dtype": "float32", "batch_input_shape": [null, 3, 256, 256], "data_format": "channels_first", "name": "zero_padding2d_1", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dtype": "float32", "filters": 8, "use_bias": true, "data_format": "channels_first", "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "batch_input_shape": [null, 3, 256, 256], "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_1", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "zero_padding2d_2", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 8, "use_bias": true, "data_format": "channels_first", "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_2", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "zero_padding2d_3", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 12, "use_bias": true, "data_format": "channels_first", "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_3", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "zero_padding2d_4", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 16, "use_bias": true, "data_format": "channels_first", "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_4", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_4", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "zero_padding2d_5", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 24, "use_bias": true, "data_format": "channels_first", "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_5", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_5", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_first", "name": "zero_padding2d_6", "padding": [[1, 1], [1, 1]]}, "class_name": "ZeroPadding2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 32, "use_bias": true, "data_format": "channels_first", "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "name": "conv2d_6", "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_6", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "reshape_1", "target_shape": [-1, 16]}, "class_name": "Reshape"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "activation": "tanh", "dtype": "float32", "use_bias": true, "stateful": false, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_dropout": 0.2, "go_backwards": false, "implementation": 0, "return_sequences": true, "dropout": 0.2, "activity_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 32, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "kernel_regularizer": null, "batch_input_shape": [null, 32, 16], "bias_regularizer": null, "name": "lstm_1", "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "activation": "tanh", "use_bias": true, "stateful": false, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_dropout": 0.2, "go_backwards": false, "implementation": 0, "return_sequences": true, "dropout": 0.2, "activity_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 16, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "lstm_2", "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "activation": "sigmoid", "use_bias": true, "stateful": false, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_dropout": 0.2, "go_backwards": false, "implementation": 0, "return_sequences": false, "dropout": 0.2, "activity_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "units": 3, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "lstm_3", "recurrent_constraint": null}, "class_name": "LSTM"}], "backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential"}